# coding: utf8

import scipy.integrate as integrate
import matplotlib.pyplot as plt
import numpy as np
import scipy as sp
from pylab import *

'''
plot(range(1, 20),
     [i**3 for i in range(1, 20)], 'ro')
#savefig('example.png')
show()
'''

plot([1,2,3,4,5,6,7,8,10,10.8,11.6,14,14.8,15.6,20,20.7,21.4,
      25,25.7,26.4,32,32.6,33.2,40,40.5,41.0,52,52.3,52.6,
      63,63.1,63.2,72.1,72.3,72.4], # 35 точек
     [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
      0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
     'b|',     markersize = 49) 
axis([0, 80, -2, 2])

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('r, mm')    # обозначение оси ординат

plt.title('Without space charge: P_input = 10 mWt, P_output = 300 Wt')

#plt.grid(True)
savefig('oldgrupelectron.png')
show()



 
#x = linspace(0, 55, 15)
#y1 = 0.1*(np.cosh(0.2*x))**1.0
#y2 = 20*(np.cosh(0.07*x))**1.0
 
#plt.plot(x, y1, 'bo')
plt.plot([0,3,7,12,16.7,21.4,26.4,31.5,35.3,39.3,43.1,47.3,51.8,55],
         [0,2,5.1,9.2,14.6,19.6,28.6,45,60,91.4,128.4,190,252,300], 'ro')

plt.axis([0, 60, -10, 300])  # задание [xmin, xmax, ymin, ymax]

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('P(z), Wt')    # обозначение оси ординат

plt.title('Without space charge: P_input = 10 mWt, P_output = 300 Wt')  # название графика
'''
plt.legend()       # вставка легенды (текста в label)
''' 


plt.grid(True)

savefig("oldgraph.png")#складывает в папку с программой
plt.show()





'''
plot(range(1, 20),
     [i**3 for i in range(1, 20)], 'ro')
#savefig('example.png')
show()
'''

'''
plot([0.5,1,1.5,2,2.5,3,3.5,4,4.5,5,5.5,6.4,
      8.5,9,11,11.2,
      13,13.3,13.7,
      15,15.5,15.8,
      17.8,17.9,18.2,19.1,19.5], # 
     [0,0,0,0,0,0,0,0,0,0,0,0,
      0,0,0,0,
      0,0,0,
      0,0,0,
      0,0,0,0,0],
     'b|',     markersize = 49) 
axis([0, 20, -2, 2])

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('r, mm')    # обозначение оси ординат

#plt.grid(True)
savefig('newgrupelectron1.png')
show()
'''

'''
plot([20.5,21.7,23,23.3,23.6,23.8,
      24.9,25.1,26,
      26.6,26.8,27,
      27.5,27.7,
      28.9,29.4,29.8,31,
      32.2,32.3,
      33.5,33.9,34.1,36.2,36.5,
      36.8,37.3,37.8,38.3,39.6], # 
     [0,0,0,0,0,0,
      0,0,0,
      0,0,0,0,0,
      0,0,0,0,0,0,
      0,0,0,0,0,0,0,0,0,0],
     'b|',     markersize = 49) 
axis([20, 40, -2, 2])

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('r, mm')    # обозначение оси ординат

#plt.grid(True)
savefig('newgrupelectron2.png')
show()



plot([40.92,41,41.12,42.16,42.28,42.3,44.59,44.64,44.78,46.15,46.18,
      47.34,47.4,47.56,48.2,48.3,50.3,50.4,50.6,50.7,53.35,
      53.4,53.5,54.8,54.9], # 
     [0,0,0,0,0,0,0,0,0,0,0,
      0,0,0,0,0,0,0,0,0,0,
      0,0,0,0],
     'b|',     markersize = 49) 
axis([40, 60, -2, 2])

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('r, mm')    # обозначение оси ординат

plt.title('With space charge: P_input = 10 mWt, P_output = 180 Wt')

#plt.grid(True)
savefig('newgrupelectron3.png')
show()

'''


plot([0.5,1,1.5,2,2.5,3,3.5,4,4.5,5,5.5,6.4,
      8.5,9,11,11.2,
      13,13.3,13.7,
      15,15.5,15.8,
      17.8,17.9,18.2,19.49,19.51,19.75,19.9,23,23.13,23.26,23.28,
      24.9,25.01,26,
      26.11,26.18,26.25,
      27.5,27.57,
      27.62,29.14,29.2,31,
      32.2,32.3,
      33.5,33.69,33.81,36.2,36.5,
      36.8,37.23,37.29,37.33,40.6,40.92,41,41.12,42.16,42.28,42.3,44.59,44.64,44.78,46.15,46.18,
      47.34,47.4,47.56,48.2,48.3,50.3,50.4,50.6,50.7,53.35,
      53.4,53.5,54.8,54.9], # 
     [0,0,0,0,0,0,0,0,0,0,0,
      0,0,0,0,0,0,0,0,0,0,
      0,0,0,0,0,0,0,0,0,0,
      0,0,0,
      0,0,0,0,0,
      0,0,0,0,0,0,
      0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
      0,0,0,0,
      0,0,0,
      0,0,0,
      0,0,0,0,0],
     'b|',     markersize = 49) 
axis([0, 60, -2, 2])

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('r, mm')    # обозначение оси ординат

plt.title('With space charge: P_input = 10 mWt, P_output = 180 Wt')

#plt.grid(True)
savefig('newgrupelectron.png')
show()





plt.plot([0,3,7,12,16.7,21.4,24.4,26.59,28.35,30.4,32.87],
         [0,2,5.1,9.2,16.6,32.6,50.8,68.6,88.7,104.5,127], 'ro')


plt.plot([35,37,40,43,47,51,55], [147,161,170,175,177,179,180], 'ro')

plt.axis([0, 60, -10, 200])  # задание [xmin, xmax, ymin, ymax]

plt.xlabel('z, cm')    # обозначение оси абсцисс
plt.ylabel('P(z), Wt')    # обозначение оси ординат

plt.title('With space charge: P_input = 10 mWt, P_output = 180 Wt')  # название графика
'''
plt.legend()       # вставка легенды (текста в label)
''' 


plt.grid(True)

savefig("newgraph.png")#складывает в папку с программой
plt.show()
















